# Ksf Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SymbolTypeId..::..Ksf Property
SymbolTypeId Class See Also
---
Symbol ksf, indicating unit Kips per square foot.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId Ksf { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property Ksf As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ Ksf {
	ForgeTypeId^ get ();
}
```

# See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace